results/isolation_test/phase_4_run_4_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 852.79 qps: 17060.78 (r/w/o: 11943.65/3411.16/1705.98) lat (ms,99%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 861.97 qps: 17239.33 (r/w/o: 12067.33/3448.07/1723.93) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 739.24 qps: 14784.18 (r/w/o: 10348.51/2957.18/1478.49) lat (ms,99%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 915.21 qps: 18304.59 (r/w/o: 12813.54/3660.64/1830.42) lat (ms,99%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 906.70 qps: 18132.55 (r/w/o: 12692.54/3626.71/1813.31) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 892.40 qps: 17846.81 (r/w/o: 12492.51/3569.50/1784.80) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            723632
        write:                           206752
        other:                           103376
        total:                           1033760
    transactions:                        51688  (861.37 per sec.)
    queries:                             1033760 (17227.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0061s
    total number of events:              51688

Latency (ms):
         min:                                    2.80
         avg:                                    4.64
         max:                                   18.65
         99th percentile:                        9.39
         sum:                               239707.77

Threads fairness:
    events (avg/stddev):           12922.0000/64.93
    execution time (avg/stddev):   59.9269/0.00