results/isolation_test/phase_5_run_2_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 801.02 qps: 16026.51 (r/w/o: 11219.62/3204.46/1602.43) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 756.11 qps: 15119.16 (r/w/o: 10582.91/3024.03/1512.22) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 764.10 qps: 15285.37 (r/w/o: 10700.08/3057.09/1528.20) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 762.50 qps: 15245.42 (r/w/o: 10671.12/3049.30/1525.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 770.00 qps: 15401.48 (r/w/o: 10781.49/3080.00/1540.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 773.20 qps: 15465.68 (r/w/o: 10825.98/3093.30/1546.40) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            647836
        write:                           185096
        other:                           92548
        total:                           925480
    transactions:                        46274  (771.17 per sec.)
    queries:                             925480 (15423.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0037s
    total number of events:              46274

Latency (ms):
         min:                                    2.35
         avg:                                    5.18
         max:                                   50.86
         99th percentile:                       44.17
         sum:                               239758.77

Threads fairness:
    events (avg/stddev):           11568.5000/47.78
    execution time (avg/stddev):   59.9397/0.00