results/isolation_test/phase_5_run_4_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 782.02 qps: 15645.56 (r/w/o: 10952.52/3128.69/1564.35) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 757.80 qps: 15155.63 (r/w/o: 10609.22/3030.71/1515.70) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 756.70 qps: 15132.81 (r/w/o: 10592.31/3027.10/1513.40) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 760.50 qps: 15210.34 (r/w/o: 10647.13/3042.21/1521.00) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 754.70 qps: 15094.15 (r/w/o: 10566.57/3018.19/1509.40) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 763.40 qps: 15267.29 (r/w/o: 10687.00/3053.60/1526.70) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            640570
        write:                           183020
        other:                           91510
        total:                           915100
    transactions:                        45755  (762.53 per sec.)
    queries:                             915100 (15250.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0037s
    total number of events:              45755

Latency (ms):
         min:                                    2.34
         avg:                                    5.24
         max:                                   51.96
         99th percentile:                       44.17
         sum:                               239755.44

Threads fairness:
    events (avg/stddev):           11438.7500/37.09
    execution time (avg/stddev):   59.9389/0.00