results/isolation_test/phase_6_run_2_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 772.11 qps: 15447.60 (r/w/o: 10814.44/3088.54/1544.62) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 753.65 qps: 15071.97 (r/w/o: 10550.05/3014.61/1507.31) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 753.92 qps: 15077.60 (r/w/o: 10554.21/3015.56/1507.83) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 750.01 qps: 15000.82 (r/w/o: 10500.55/3000.24/1500.02) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 756.79 qps: 15133.69 (r/w/o: 10593.15/3026.96/1513.58) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 757.20 qps: 15147.40 (r/w/o: 10603.67/3029.32/1514.41) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            636580
        write:                           181880
        other:                           90940
        total:                           909400
    transactions:                        45470  (757.32 per sec.)
    queries:                             909400 (15146.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0400s
    total number of events:              45470

Latency (ms):
         min:                                    2.34
         avg:                                    5.28
         max:                                   50.03
         99th percentile:                       44.17
         sum:                               239909.77

Threads fairness:
    events (avg/stddev):           11367.5000/34.14
    execution time (avg/stddev):   59.9774/0.00